# CreateAddInCommandBinding Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
UIControlledApplication..::..CreateAddInCommandBinding Method
UIControlledApplication Class See Also
---
Creates a new AddInCommandBinding.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public AddInCommandBinding CreateAddInCommandBinding(
	RevitCommandId revitCommandId
)
```

Visual Basic
---
```text
Public Function CreateAddInCommandBinding ( _
	revitCommandId As RevitCommandId _
) As AddInCommandBinding
```

Visual C++
---
```text
public:
AddInCommandBinding^ CreateAddInCommandBinding(
	RevitCommandId^ revitCommandId
)
```

# ### Parameters
revitCommandId
    Type: Autodesk.Revit.UI..::..RevitCommandIdThe Revit command id to identify the command handler you want to replace.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | Thrown when uiApplication or revitCommandId is nullNothingnullptra null reference (Nothing in Visual Basic). |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown when the given command already has been bound. |

# See Also
UIControlledApplication Class
Autodesk.Revit.UI Namespace